In [1]:
import pandas as pd
member = pd.Series(['홍길동', '전우치', '이순신', '강감찬'])
member

0    홍길동
1    전우치
2    이순신
3    강감찬
dtype: object

    홍길동, 전우치 등 앞에 붙은 0~4를 index라 부름.
    내부적으로 관리하기 위해 알아서 줄 번호를 붙인 것.
    Series는 이 index를 바꿀 수 있음.

In [2]:
member = pd.Series(['홍길동', '전우치', '이순신', '강감찬'], 
                   index = ['1번', '2번', '3번', '4번'])
member

1번    홍길동
2번    전우치
3번    이순신
4번    강감찬
dtype: object

    index가 지정한 대로 바뀐 걸 볼 수 있다.

    Dictionary 자료형으로도 Series를 생성할 수 있다.

In [3]:
sal_1 = {'홍길동' : 100, '전우치' : 130, '이순신' : 120}
sal_2 = pd.Series(sal_1)
sal_2

홍길동    100
전우치    130
이순신    120
dtype: int64

In [4]:
# 특정 행만 조회하고 싶을 땐, 행 번호를 인자로 넣어준다.
member[0]

'홍길동'

In [5]:
# index이름으로도 조회가 가능.
member['1번']

'홍길동'

In [6]:
# 여러 행을 조회하고 싶을땐?
member[['1번', '3번']]

1번    홍길동
3번    이순신
dtype: object

In [10]:
# Series간 사칙연산도 가능.
sal_3 = {'홍길동' : 10, '강감찬' : 12, '이순신' : 20}
sal_4 = pd.Series(sal_3)
sal_2 + sal_4

강감찬      NaN
이순신    140.0
전우치      NaN
홍길동    110.0
dtype: float64

    한쪽에 없는 값은 NaN으로 나옴.

In [11]:
member3 = {'번호' : ['1번', '2번', '3번'], 
           '이름' : ['홍길동', '전우치', '강감찬'],
           '생일' : [1975, 1980, 1992]}
member4 = pd.DataFrame(member3)
member4

   번호   이름    생일
0  1번  홍길동  1975
1  2번  전우치  1980
2  3번  강감찬  1992

In [13]:
# 특정 컬럼을 지정해서 그 컬럼의 값만 보고싶으면?
member4['생일']

0    1975
1    1980
2    1992
Name: 생일, dtype: int64

In [15]:
member4[['이름', '생일']]

    이름    생일
0  홍길동  1975
1  전우치  1980
2  강감찬  1992

- 원하는 행만 조회하고 싶으면?
    * 행 번호를 지정해 모든 데이터를 조회
    * 조건을 부여해 해당하는 데이터만 조회

In [17]:
# 행 번호를 지정
member4.loc[0]

번호      1번
이름     홍길동
생일    1975
Name: 0, dtype: object

In [18]:
# 번호가 2번 이상인 사람들만 뽑아내고 싶으면?
member4.loc[member4['번호'] >= '2번']

   번호   이름    생일
1  2번  전우치  1980
2  3번  강감찬  1992

In [20]:
member5 = {'번호' : ['1번', '2번', '3번', '4번', '5번'],
           '이름' : ['홍길동', '전우치', '강감찬', '홍길동', '일지매'], 
           '매출' : [100, 200, 250, 300, 150]}
member6 = pd.DataFrame(member5, columns=['번호', '이름', '매출'])
member6

   번호   이름   매출
0  1번  홍길동  100
1  2번  전우치  200
2  3번  강감찬  250
3  4번  홍길동  300
4  5번  일지매  150

In [23]:
# 매출이 100이상이면서 200이하인 것들만 조회?
member6.loc[(member6['매출'] >= 100)&(member6['매출'] <= 200)]

   번호   이름   매출
0  1번  홍길동  100
1  2번  전우치  200
4  5번  일지매  150

In [24]:
# 행/열 추가?
member7 = pd.DataFrame(member6, columns = ['번호', '이름', '매출', '지역'])
member7

   번호   이름   매출  지역
0  1번  홍길동  100 NaN
1  2번  전우치  200 NaN
2  3번  강감찬  250 NaN
3  4번  홍길동  300 NaN
4  5번  일지매  150 NaN

In [25]:
member7['지역'] = ['서울', '부산', '대전', '대구', '광주']

In [26]:
member7

   번호   이름   매출  지역
0  1번  홍길동  100  서울
1  2번  전우치  200  부산
2  3번  강감찬  250  대전
3  4번  홍길동  300  대구
4  5번  일지매  150  광주

In [27]:
member7.loc[5] = ['6번', '호날두', 500, '유벤티스']
member7

   번호   이름   매출    지역
0  1번  홍길동  100    서울
1  2번  전우치  200    부산
2  3번  강감찬  250    대전
3  4번  홍길동  300    대구
4  5번  일지매  150    광주
5  6번  호날두  500  유벤티스

In [28]:
# 삭제?
# 조건으로 줘도 되고, 행 번호를 줘도 된다.
member7.drop([0])

   번호   이름   매출    지역
1  2번  전우치  200    부산
2  3번  강감찬  250    대전
3  4번  홍길동  300    대구
4  5번  일지매  150    광주
5  6번  호날두  500  유벤티스

In [31]:
member7.drop( member7[member7.지역 == '광주'].index )

   번호   이름   매출    지역
0  1번  홍길동  100    서울
1  2번  전우치  200    부산
2  3번  강감찬  250    대전
3  4번  홍길동  300    대구
5  6번  호날두  500  유벤티스